dic = ({1: '정근우'}, {2: '이용규'}, {3: '송광민'}, {4: '최진행'}, {5: '하주석'}, {6: '장민석'}, {7: '로사리오'}, {8: '이양기'}, {9: '최재훈'})

for i in dic :
    print(list(i.items()))

'''
[(1, '정근우')]
[(2, '이용규')]
[(3, '송광민')]
[(4, '최진행')]
[(5, '하주석')]
[(6, '장민석')]
[(7, '로사리오')]
[(8, '이양기')]
[(9, '최재훈')]
'''

for i in dic :
    print(list(i.items())[0])
'''
(1, '정근우')
(2, '이용규')
(3, '송광민')
(4, '최진행')
(5, '하주석')
(6, '장민석')
(7, '로사리오')
(8, '이양기')
(9, '최재훈')
'''

for i in dic :
    num, name = list(i.items())[0]
    print(num, name)
'''
1 정근우
2 이용규
3 송광민
4 최진행
5 하주석
6 장민석
7 로사리오
8 이양기
9 최재훈
'''